In [1]:
import pandas as pd
import numpy as np

In [2]:
wrecks_df = pd.read_excel("data/shipwrecks_with_country.xlsx")
wrecks_df

                      date        lat        lon                      near
0      1996-05-13 05:50:00  40.876665 -91.031665  United States of America
1      1996-05-13 05:50:01  40.876665 -91.031665  United States of America
2      1996-05-13 05:50:01  40.876665 -91.031665  United States of America
3      1996-05-13 05:50:02  40.876665 -91.031665  United States of America
4      1996-05-13 05:50:02  40.876665 -91.031665  United States of America
...                    ...        ...        ...                       ...
106261 2015-06-22 14:10:01  37.310490 -89.513615  United States of America
106262 2015-06-22 16:35:00  25.760800 -79.956670  United States of America
106263 2015-06-22 16:35:00  25.760800 -79.956670  United States of America
106264 2015-06-24 13:52:00  29.732314 -95.127879  United States of America
106265 2015-06-24 13:53:00  29.732314 -95.127879  United States of America

[106266 rows x 4 columns]

In [3]:
A = np.array([25.7617, -80.1918])   # Miami
B = np.array([32.3078, -64.7505])   # Bermuda
C = np.array([18.4655, -66.1057])   # San Juan

def _cross(u: np.ndarray, v: np.ndarray) -> float:
    return u[0]*v[1] - u[1]*v[0]

def _same_side(p: np.ndarray, a: np.ndarray, b: np.ndarray, c: np.ndarray) -> bool:
    """Return True if p is on the same side of AB as C is."""
    cp1 = _cross(b - a, p - a)
    cp2 = _cross(b - a, c - a)
    return cp1 * cp2 >= 0

def in_bermuda(row: pd.Series) -> bool:
    """Return True if row['lat'], row['lon'] lies inside Bermuda Triangle."""
    p = np.array([row.lat, row.lon])

    return (
        _same_side(p, A, B, C) and
        _same_side(p, B, C, A) and
        _same_side(p, C, A, B)
    )

In [4]:
wrecks_df["in_bermuda"] = wrecks_df.apply(in_bermuda, axis=1)
wrecks_df

,date,lat,lon,near,in_bermuda
0,1996-05-13 05:50:00,40.876665,-91.031665,United States of America,False
1,1996-05-13 05:50:01,40.876665,-91.031665,United States of America,False
2,1996-05-13 05:50:01,40.876665,-91.031665,United States of America,False
3,1996-05-13 05:50:02,40.876665,-91.031665,United States of America,False
4,1996-05-13 05:50:02,40.876665,-91.031665,United States of America,False
...,...,...,...,...,...
106261,2015-06-22 14:10:01,37.310490,-89.513615,United States of America,False
106262,2015-06-22 16:35:00,25.760800,-79.956670,United States of America,True
106263,2015-06-22 16:35:00,25.760800,-79.956670,United States of America,True
106264,2015-06-24 13:52:00,29.732314,-95.127879,United States of America,False
106265,2015-06-24 13:53:00,29.732314,-95.127879,United States of America,False

In [6]:
wrecks_df.in_bermuda.value_counts()

in_bermuda
False    105750
True        516
Name: count, dtype: int64

In [5]:
wrecks_df.to_excel("data/shipwrecks_with_bermuda.xlsx", index=False)